{
	"srcLogo": "/images/logo.png",
	"navbar": [
		{
			"title": "About Me",
			"href": "about"
		},
		{
			"title": "Experience",
			"href": "experience"
		},
		{
			"title": "Skills",
			"href": "skills"
		},
		{
			"title": "Projects",
			"href": "projects"
		},
		{
			"title": "Contact",
			"href": "contact"
		}
	],
	"home": {
		"title": "Hello, I'm",
		"name": "Breno Crepaldi",
		"subtitle": "Software Developer",
		"resume": {
			"resumeTitle": "Download my CV",
			"download": "Resume-BrenoCrepaldi.pdf"
		},
		"contact": {
			"contactTitle": "Get in Touch",
			"href": "#contact"
		}
	},
	"about": {
		"title": "About Me",
		"description": "I'm a software developer who thrives on exploring new technologies and taking on innovative projects. I’m always eager to expand my skill set and dive into exciting challenges. My work is all about turning fresh ideas into reality and pushing the envelope with creative solutions. I’m passionate about continuous learning and bringing a hands-on approach to every project I tackle. Whether it’s building something from scratch or improving on existing tech, I’m here to make a difference and keep things moving forward."
	},
	"experience": {
		"title": "Experience",
		"jobs": [
			{
				"company": "Espectro LTD",
				"position": "Front-End Developer",
				"duration": "May 2024 — Present",
				"description": "Build, style, and maintain high-quality, responsive web applications. Develop server-side logic and APIs with Python to support front-end with ReactJS functionality and optimize performance. Collaborate closely with the development team to implement new features, troubleshoot and debug issues, and enhance the user experience. Write clean, efficient, and well-documented code, and assist in the deployment and monitoring of web applications. This role has given me hands-on experience in modern web development practices and has significantly enhanced my skills in creating dynamic digital experiences.",
				"technologies": ["JavaScript", "React", "HTML", "CSS"]
			}
		]
	},
	"skills": {
		"title": "Skills",
		"skillSet": {
			"skillList": [
				{
					"name": "react",
					"icon": "react"
				},

				{
					"name": "JavaScript",
					"icon": "javascript"
				},
				{
					"name": "HTML",
					"icon": "html5"
				},
				{
					"name": "CSS",
					"icon": "css3"
				},
				{
					"name": "Node.js",
					"icon": "nodeJs"
				},
				{
					"name": "GitHub",
					"icon": "gitHub"
				},
				{
					"name": "Git",
					"icon": "git"
				},
				{
					"name": "Python",
					"icon": "python"
				},
				{
					"name": "SQL",
					"icon": "sql"
				},
				{
					"name": "PostgreSQL",
					"icon": "postgre"
				}
			]
		}
	},
	"projects": {
		"title": "Projects",
		"projectList": [
			{
				"image":"/images/avalie.png",
				"name": "Avali-e",
				"description": "Web platform developed for academic performance evaluation in higher education institutions, allowing students to provide feedback on professors and courses, while faculty and administrators track metrics and reports. The project features interactive dashboards, role-based access control, and secure JWT authentication. It was built focusing on scalable architecture, strong UX, and clear data visualization.",
				"url": "https://github.com/brenocrepaldi/avalie",
				"technologies": [
					"ReactJS",
					"TypeScript",
					"Tailwind CSS",
					"JSON Web Token (JWT)",
					"Vite"
				]
			},
			{
				"name": "Authentication and Authorization API",
				"description": "Authentication and authorization API built with Node.js and TypeScript, focused on secure access control and industry best practices. The project features JWT-based authentication, cookie-based session management, and token invalidation through blacklisting on logout. Data is persisted in MongoDB, along with protected routes, role-based access control, strong data validation, and type safety for improved reliability.",
				"url": "https://github.com/brenocrepaldi/auth-system",
				"technologies": [
					"NodeJS",
					"TypeScript",
					"Cookies",
					"JSON Web Token (JWT)",
					"MongoDB"
				]
			},
			{
				"image": "/images/nearby.png",
				"name": "Nearby",
				"description": "Mobile application designed to connect users with exclusive coupons from nearby businesses, enhancing the local shopping experience. This project was my first experience with React Native, providing hands-on learning in mobile development, API integration, and location-based features. It also involved building responsive, user-focused interfaces and managing backend data efficiently.",
				"url": "https://github.com/brenocrepaldi/nearby-mobile",
				"technologies": [
					"React Native",
					"TypeScript",
					"NodeJS",
					"Express",
					"Prisma"
				],
				"isMobile": true
			},
			{
				"image": "/images/planner.png",
				"name": "Planner",
				"description": "A full-stack application that enables users to collaboratively plan trips by inviting friends, selecting destinations and dates, and managing trip details. It utilizes a RESTful API, which was developed as part of the project, to facilitate tasks such as creating trips, managing activities, and sharing information.",
				"url": "https://github.com/brenocrepaldi/planner-frontend",
				"technologies": [
					"ReactJS",
					"TypeScript",
					"HTML",
					"Tailwind CSS",
					"NodeJS",
					"Prisma",
					"Fastify"
				]
			},
			{
				"image": "/images/recon.png",
				"name": "Recon AI",
				"description": "A sophisticated clothing recommendation system designed to provide users with tailored product suggestions based on their preferences. The project enables users to filter products according to their criteria and select a favorite item. Using advanced algorithms, Recon-IA analyzes the chosen product and calculates its similarity to other items in the database. This results in personalized recommendations that align closely with the user's tastes and preferences.",
				"url": "https://github.com/brenocrepaldi/recon-ai",
				"technologies": ["Python", "JavaScript", "HTML", "CSS"]
			},
			{
				"image": "/images/notes.png",
				"name": "Notes",
				"description": "Versatile application designed to streamline the process of note-taking by offering both automatic audio transcription and manual text input. The application is built with a focus on providing a comprehensive and efficient note management experience.",
				"url": "https://github.com/brenocrepaldi/audio-notes",
				"technologies": [
					"ReactJS",
					"TypeScript",
					"HTML",
					"Tailwind CSS",
					"Vite",
					"Lucide",
					"Date-fns",
					"Sooner"
				]
			},
			{
				"image": "/images/quiz.png",
				"name": "Quiz",
				"description": "An innovative educational tool designed to make learning enjoyable and engaging through the use of a fun quiz format. The tool features a series of questions and answers that cover a wide range of topics, making it suitable for users of all ages and knowledge levels.",
				"url": "https://github.com/brenocrepaldi/quiz",
				"technologies": ["JavaScript", "HTML", "CSS"]
			},
			{
				"image": "/images/airline.png",
				"name": "Airline Administration System",
				"description": "A comprehensive administrative backend for an airline company, designed to efficiently manage key aspects of airline operations. This backend project includes various modules for registering and viewing detailed information on aircraft, airports, flights, routes, and manufacturers. It provides a robust and organized solution for effectively managing airline data and streamlining operational processes.",
				"url": "https://github.com/brenocrepaldi/projeto-integrador-cia",
				"technologies": [
					"NodeJS",
					"TypeScript",
					"Handlebars",
					"CSS",
					"Oracle Database"
				]
			},
			{
				"image": "/images/android.png",
				"name": "Android",
				"description": "One of my first major projects, this work involved developing a website with a focus on site structure, code organization, media integration, design principles, and responsive design. The final result demonstrates a well-structured and visually appealing web presence.",
				"url": "https://github.com/brenocrepaldi/android-page",
				"technologies": ["HTML", "CSS"]
			}
		]
	},
	"contacts": {
		"title": "Get in touch",
		"contactList": [
			{
				"title": "GitHub",
				"content": "https://github.com/brenocrepaldi",
				"icon": "github"
			},
			{
				"title": "LinkedIn",
				"content": "https://www.linkedin.com/in/brenocrepaldi",
				"icon": "linkedin"
			},
			{
				"title": "WhatsApp",
				"content": "https://wa.me/+5519974180062",
				"icon": "whatsapp"
			},
			{
				"title": "E-mail",
				"content": "mailto:brenogaia2004@gmail.com",
				"icon": "email"
			}
		]
	},
	"footer": {
		"text": "Developed with <strong>Vite</strong> and <strong>CSS</strong>. Coded in <strong>Visual Studio Code</strong> using <strong>React</strong>, deployed with <strong>Vercel</strong>. All text is set in the <strong>Inter</strong> typeface."
	}
}
