{
	"navbar": [
		{
			"title": "Sobre Mim",
			"href": "about"
		},
		{
			"title": "Experiência",
			"href": "experience"
		},
		{
			"title": "Habilidades",
			"href": "skills"
		},
		{
			"title": "Projetos",
			"href": "projects"
		},
		{
			"title": "Contatos",
			"href": "contact"
		}
	],
	"home": {
		"title": "Olá, meu nome é",
		"name": "Breno Crepaldi",
		"subtitle": "Desenvolvedor de Software",
		"resume": {
			"resumeTitle": "Baixe meu CV",
			"download": "Currículo-BrenoCrepaldi.pdf"
		},
		"contact": {
			"contactTitle": "Entrar em contato",
			"href": "#contact"
		}
	},
	"about": {
		"title": "Sobre Mim",
		"description": "Sou um desenvolvedor de software apaixonado por explorar novas tecnologias e enfrentar projetos inovadores. Sempre estou em busca de expandir minhas habilidades e explorar desafios interessantes. Meu foco é transformar ideias criativas em soluções reais e relevantes. Adoro aprender constantemente e aplicar uma abordagem prática em cada projeto. Seja desenvolvendo algo do zero ou melhorando o que já existe, meu objetivo é contribuir de forma significativa e avançar projetos com dedicação."
	},
	"experience": {
		"title": "Experiência",
		"jobs": [
			{
				"company": "Espectro LTDA",
				"position": "Desenvolvedor Front-End",
				"duration": "Mai 2024 — Atual",
				"description": "Construo, estilizo e mantenho aplicações web responsivas de alta qualidade. Desenvolvo lógica e APIs no servidor com Node.js para suportar funcionalidades do front-end e otimizar o desempenho. Colaboro de perto com a equipe de desenvolvimento para implementar novos recursos, solucionar problemas e depurar questões, além de melhorar a experiência do usuário. Escrevo código limpo, eficiente e bem documentado, e auxilio na implantação e monitoramento de aplicações web. Esta posição proporcionou-me experiência prática em práticas modernas de desenvolvimento web e significativamente aprimorou minhas habilidades na criação de experiências digitais dinâmicas.",
				"technologies": ["JavaScript", "React", "HTML", "CSS"]
			}
		]
	},
	"skills": {
		"title": "Habilidades",
		"skillSet": {
			"skillList": [
				{
					"name": "react",
					"icon": "react"
				},

				{
					"name": "JavaScript",
					"icon": "javascript"
				},
				{
					"name": "HTML",
					"icon": "html5"
				},
				{
					"name": "CSS",
					"icon": "css3"
				},
				{
					"name": "Node.js",
					"icon": "nodeJs"
				},
				{
					"name": "GitHub",
					"icon": "gitHub"
				},
				{
					"name": "Git",
					"icon": "git"
				},
				{
					"name": "Python",
					"icon": "python"
				},
				{
					"name": "SQL",
					"icon": "sql"
				},
				{
					"name": "PostgreSQL",
					"icon": "postgre"
				}
			]
		}
	},
	"projects": {
		"title": "Projetos",
		"projectList": [
			{
				"image": "../src/assets/images/planner.png",
				"name": "Planner",
				"description": "Uma aplicação full-stack projetada para facilitar o planejamento colaborativo de viagens. Usuários podem convidar amigos, escolher destinos, definir datas e gerenciar todos os detalhes da viagem em um ambiente intuitivo. Utilizando uma API RESTful desenvolvida especificamente para o projeto, o Planner permite criar viagens, gerenciar atividades e compartilhar informações de forma fluida e integrada.",
				"url": "https://github.com/brenocrepaldi/planner-frontend",
				"technologies": [
					"ReactJS",
					"TypeScript",
					"HTML",
					"Tailwind CSS",
					"NodeJS",
					"Prisma",
					"Fastify"
				]
			},
			{
				"image": "../src/assets/images/recon.png",
				"name": "Recon AI",
				"description": "Um sistema avançado de recomendação de roupas que oferece sugestões personalizadas com base nas preferências do usuário. Através de um processo de filtragem criteriosa, os usuários podem selecionar seus produtos favoritos. O sistema utiliza algoritmos sofisticados para analisar e comparar os itens escolhidos com outros no banco de dados, gerando recomendações que refletem com precisão os gostos individuais de cada usuário.",
				"url": "https://github.com/brenocrepaldi/recon-ai",
				"technologies": ["Python", "JavaScript", "HTML", "CSS"]
			},
			{
				"image": "../src/assets/images/notes.png",
				"name": "Notes",
				"description": "Uma aplicação versátil desenvolvida para otimizar a tomada de notas, combinando transcrição automática de áudio com a possibilidade de entrada manual de texto. Com um design voltado para a eficiência e a gestão completa das notas, o aplicativo oferece uma experiência completa e intuitiva para usuários que precisam organizar e acessar suas anotações de maneira prática.",
				"url": "https://github.com/brenocrepaldi/audio-notes",
				"technologies": [
					"ReactJS",
					"TypeScript",
					"HTML",
					"Tailwind CSS",
					"Vite",
					"Lucide",
					"Date-fns",
					"Sooner"
				]
			},
			{
				"image": "../src/assets/images/quiz.png",
				"name": "Quiz",
				"description": "Uma ferramenta educacional inovadora que transforma o aprendizado em uma experiência divertida e interativa. Através de um formato de quiz, oferece uma série de perguntas e respostas sobre uma ampla gama de tópicos, tornando o aprendizado acessível e interessante para usuários de todas as idades e níveis de conhecimento.",
				"url": "https://github.com/brenocrepaldi/quiz",
				"technologies": ["JavaScript", "HTML", "CSS"]
			},
			{
				"image": "../src/assets/images/airline.png",
				"name": "Sistema de Administração de Companhia Aérea",
				"description": "Uma solução completa para a administração de uma companhia aérea, permitindo gerenciar com eficiência aeronaves, aeroportos, voos, rotas e fabricantes. Desenvolvido para atender às necessidades operacionais da companhia, o sistema oferece uma interface robusta e organizada para a gestão de dados e a otimização dos processos administrativos.",
				"url": "https://github.com/brenocrepaldi/projeto-integrador-cia",
				"technologies": [
					"NodeJS",
					"TypeScript",
					"Handlebars",
					"CSS",
					"Oracle Database"
				]
			},
			{
				"image": "../src/assets/images/android.png",
				"name": "Android",
				"description": "Um dos meus primeiros projetos. Um site com foco em estruturação, organização de código, integração de mídias e design responsivo. O resultado é um site bem estruturado e visualmente atraente, demonstrando uma abordagem sólida aos princípios de design e boas práticas de desenvolvimento web.",
				"url": "https://github.com/brenocrepaldi/android-page",
				"technologies": ["HTML", "CSS"]
			}
		]
	},
	"contacts": {
		"title": "Entre em contato",
		"contactList": [
			{
				"title": "GitHub",
				"content": "https://github.com/brenocrepaldi",
				"icon": "github"
			},
			{
				"title": "LinkedIn",
				"content": "https://www.linkedin.com/in/brenocrepaldi",
				"icon": "linkedin"
			},
			{
				"title": "WhatsApp",
				"content": "https://wa.me/+5519974180062",
				"icon": "whatsapp"
			},
			{
				"title": "E-mail",
				"content": "mailto:brenogaia2004@gmail.com",
				"icon": "email"
			}
		]
	}
}
